---
kind: type
id: T:Autodesk.Revit.DB.PrintParameters
source: html/59e6cfe9-b1e8-70c0-814b-ee69c8fca411.htm
---
# Autodesk.Revit.DB.PrintParameters

An object that contains settings used for printing the document.

## Syntax (C#)
```csharp
public class PrintParameters : APIObject
```